Практос_2/src/Documents/ПубликацияВакансии/ПубликацияВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПубликацияВакансии</name>
  <basedOn>Document.ЗаявкаНаПодбор</basedOn>
  <registerRecords>AccumulationRegister.БюджетМаркетингаHR</registerRecords>
  <registerRecords>InformationRegister.ИсторияКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаПодбор</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Рубли</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазмещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРазмещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОпубликованнойВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратНаПодбор</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникПривлечения</name>
      <type>
        <types>CatalogRef.ИсточникПривлечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Рубли</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Практос_2/src/AccumulationRegisters/ЗатратыНаПодбор/ЗатратыНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаПодбор</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗатратыНаПодбор</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатратНаПодбор</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практос_2/src/AccumulationRegisters/БюджетМаркетингаHR/БюджетМаркетингаHR.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БюджетМаркетингаHR</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникПривлечения</name>
    <type>
      <types>CatalogRef.ИсточникПривлечения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатратНаПодбор</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практос_2/src/Documents/ПубликацияВакансии/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПодбор") Тогда
		// Заполнение шапки
		ДатаОкончанияРазмещения = ДанныеЗаполнения.ДатаСрочности;
		Вакансия = ДанныеЗаполнения.Должность;
		Сумма = ДанныеЗаполнения.ЗарплатаПослеВычета;
		Организация = ДанныеЗаполнения.Контрагент;
		Ответственный = ДанныеЗаполнения.Рекрутер;
		//Статус = Статусы
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗатратыНаПодбор Приход
	Движения.ЗатратыНаПодбор.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ЗатратыНаПодбор.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗатратыНаПодбор = Вакансия;
		Движение.СтатьяЗатрат = ТекСтрокаЗатраты.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	// регистр БюджетМаркетингаHR Расход
	Движения.БюджетМаркетингаHR.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.БюджетМаркетингаHR.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ИсточникПривлечения = ТекСтрокаЗатраты.ИсточникПривлечения;
		Движение.СтатьяЗатрат = ТекСтрокаЗатраты.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
